Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MX_DFP/1.5.259/atdf/PIC32MX440F512H.atdf
         <register caption="Input Capture 1 Control Register" name="IC2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC2CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC2CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC2CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC2CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC2CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC2CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC2CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC2CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC2CON__ON" />
         </register>
         <register caption="Input Capture 1 Control Register" name="IC3CON" offset="0x400" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC3CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC3CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC3CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC3CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC3CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC3CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC3CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC3CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC3CON__ON" />
         </register>
         <register caption="Input Capture 1 Control Register" name="IC4CON" offset="0x600" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC4CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC4CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC4CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC4CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC4CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC4CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC4CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC4CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC4CON__ON" />
         </register>
         <register caption="Input Capture 1 Control Register" name="IC5CON" offset="0x800" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC5CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit (read-only)" mask="0x00000008" name="ICBNE" values="IC5CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit (read-only)" mask="0x00000010" name="ICOV" values="IC5CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC5CON__ICI" />
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC5CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC5CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC5CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC5CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC5CON__ON" />
         </register>
         <register caption="" name="IC1BUF" offset="0x10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC1BUF" />
         </register>
         <register caption="" name="IC2BUF" offset="0x210" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC2BUF" />
         </register>
         <register caption="" name="IC3BUF" offset="0x410" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC3BUF" />
         </register>
         <register caption="" name="IC4BUF" offset="0x610" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC4BUF" />
         </register>
         <register caption="" name="IC5BUF" offset="0x810" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC5BUF" />
         </register>
      </register-group>
      <value-group caption="Input Capture Mode Select bits" name="IC1CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7" />
         <value caption="Simple Capture Event mode every edge, specified edge first and every edge thereafter" name="" value="0x6" />
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5" />
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4" />
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3" />
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2" />
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1" />
         <value caption="Input Capture module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit (read-only)" name="IC1CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit (read-only)" name="IC1CON__ICOV">
         <value caption="Input capture overflow has occurred" name="" value="0x1" />
         <value caption="No input capture overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC1CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3" />
         <value caption="Interrupt on every third capture event" name="" value="0x2" />
         <value caption="Interrupt on every second capture event" name="" value="0x1" />
         <value caption="Interrupt on every capture event" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Select bit" name="IC1CON__ICTMR">
         <value caption="Timer3 is the counter source for capture" name="" value="0x0" />
         <value caption="Timer2 is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC1CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC1CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC1CON__SIDL">
         <value caption="Halt in Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC1CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module, disable clocks, disable interrupt generation and allow SFR modifications" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC2CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7" />
         <value caption="Simple Capture Event mode every edge, specified edge first and every edge thereafter" name="" value="0x6" />
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5" />
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4" />
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3" />
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2" />
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1" />
         <value caption="Input Capture module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit (read-only)" name="IC2CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit (read-only)" name="IC2CON__ICOV">
         <value caption="Input capture overflow has occurred" name="" value="0x1" />
         <value caption="No input capture overflow has occurred" name="" value="0x0" />
      </value-group>
